## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #43
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.blue_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-blue-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-blue-tg/0c5c13149f9c222a",
        ]
      + vpc_zone_identifier              = [
          + "subnet-0aad52366681660c5",
          + "subnet-0dc4c26091c0265f1",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = "lt-024b7e325c6994377"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "blue"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-blue-asg"
        }
    }

  # module.blue_asg.aws_autoscaling_policy.cpu_policy will be created
  + resource "aws_autoscaling_policy" "cpu_policy" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "staging-blue-asg"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "staging-blue-cpu-policy"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.blue_asg.aws_cloudwatch_metric_alarm.cpu_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors EC2 CPU utilization"
      + alarm_name                            = "staging-blue-cpu-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "staging-blue-asg"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.blue_asg.aws_launch_template.asg will be updated in-place
  ~ resource "aws_launch_template" "asg" {
        id                      = "lt-024b7e325c6994377"
      ~ image_id                = "ami-0c02fb55956c7d316" -> "ami-06c8f2ec674c67112"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "staging-blue-lt20250626155053060100000009"
        tags                    = {
            "Name" = "staging-blue-launch-template"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.green_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "staging-green-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:us-east-2:123324351829:targetgroup/staging-green-tg/ec6a6d7365a82d0b",
        ]
      + vpc_zone_identifier              = [
          + "subnet-0aad52366681660c5",
          + "subnet-0dc4c26091c0265f1",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = "lt-06918683226179bc9"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "green"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-green-asg"
        }
    }

  # module.green_asg.aws_autoscaling_policy.cpu_policy will be created
  + resource "aws_autoscaling_policy" "cpu_policy" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "staging-green-asg"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "staging-green-cpu-policy"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.green_asg.aws_cloudwatch_metric_alarm.cpu_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors EC2 CPU utilization"
      + alarm_name                            = "staging-green-cpu-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "staging-green-asg"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.green_asg.aws_launch_template.asg will be updated in-place
  ~ resource "aws_launch_template" "asg" {
        id                      = "lt-06918683226179bc9"
      ~ image_id                = "ami-0c02fb55956c7d316" -> "ami-06c8f2ec674c67112"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "staging-green-lt20250626155052918200000007"
        tags                    = {
            "Name" = "staging-green-launch-template"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.oidc.aws_iam_role_policy.terraform_permissions will be created
  + resource "aws_iam_role_policy" "terraform_permissions" {
      + id          = (known after apply)
      + name        = "terraform-permissions-staging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tf-playground-state-vexus",
                          + "arn:aws:s3:::tf-playground-state-vexus/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:*:table/tf-playground-locks"
                    },
                  + {
                      + Action   = [
                          + "ec2:*",
                          + "elasticloadbalancing:*",
                          + "autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:*",
                          + "elasticloadbalancing:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:PassRole",
                          + "iam:CreateRole",
                          + "iam:CreatePolicy",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:DeletePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "iam:UntagRole",
                          + "iam:UntagPolicy",
                          + "iam:ListRolePolicies",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListPolicyVersions",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:ListInstanceProfilesForRole",
                          + "iam:CreateInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:GetInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:TagInstanceProfile",
                          + "iam:UntagInstanceProfile",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::*:role/tf-playground-*",
                          + "arn:aws:iam::*:role/github-actions-*",
                          + "arn:aws:iam::*:role/staging-*",
                          + "arn:aws:iam::*:role/dev-*",
                          + "arn:aws:iam::*:role/prod-*",
                          + "arn:aws:iam::*:role/production-*",
                          + "arn:aws:iam::*:policy/tf-playground-*",
                          + "arn:aws:iam::*:policy/staging-*",
                          + "arn:aws:iam::*:policy/dev-*",
                          + "arn:aws:iam::*:policy/prod-*",
                          + "arn:aws:iam::*:policy/production-*",
                          + "arn:aws:iam::*:instance-profile/staging-*",
                          + "arn:aws:iam::*:instance-profile/dev-*",
                          + "arn:aws:iam::*:instance-profile/prod-*",
                          + "arn:aws:iam::*:instance-profile/production-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:ListOpenIDConnectProviders",
                          + "iam:GetOpenIDConnectProvider",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "github-actions-staging"
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + blue_asg_id               = (known after apply)
  + environment_summary       = {
      + alb_dns_name      = "staging-alb-941196743.us-east-2.elb.amazonaws.com"
      + application_url   = "http://staging-alb-941196743.us-east-2.elb.amazonaws.com"
      + blue_asg_name     = "staging-blue-asg"
      + database_endpoint = "staging-db.c38ukeqk0mqb.us-east-2.rds.amazonaws.com:3306"
      + environment       = "staging"
      + green_asg_name    = "staging-green-asg"
      + region            = "us-east-2"
      + vpc_id            = "vpc-0c3aec46bbb4ee778"
    }
  + green_asg_id              = (known after apply)

  ```
  
  </details>